ELPasEDT/src/ChartsOfCharacteristicTypes/РеквизитыПаспортовОборудования/РеквизитыПаспортовОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>РеквизитыПаспортовОборудования</name>
  <comment>(ИТ-Плюс)</comment>
  <type>
    <types>CatalogRef.ЗаводыИзготовители</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.ЗначенияРеквизитовПаспортов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>Периодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

ELPasEDT/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>СогласованаПлощадкой</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/ChartsOfCharacteristicTypes/РеквизитыПаспортовОборудования/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Статус.Видимость = ОтображатьГруппуЗаявок();
	Элементы.ТипЗначения.Доступность = Объект.Ссылка.Пустая() И Не Объект.Заявка;
	
КонецПроцедуры  

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Заявка И (Объект.Статус = Перечисления.СтатусыЗаявок.НаРассмотрении ИЛИ Объект.Статус = Перечисления.СтатусыЗаявок.СогласованаПлощадкой
	        ИЛИ Объект.Статус = Перечисления.СтатусыЗаявок.Согласована);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Заявка = Истина;
		Объект.Статус = Перечисления.СтатусыЗаявок.НаРассмотрении;
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверкаСтатусаУспешно() Тогда
		ПоказатьПредупреждение(, "Можно утвердить только согласованные заявки!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСтатусаУспешно()
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Утверждена") И Не Объект.Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласована") Тогда
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
